app/views/devise/registrations/new.html.erb

      <%= f.label :company_id %><br>
      <%= f.select :company_id, options_for_select(Company.all.pluck(:name, :id)), {}, class: "form-control border border-gray-400" %>
---
SELECT "companies"."name", "companies"."id" FROM "companies"