app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "khalil"], ["body", "ùmlkjhgfghjklmùmlkjhg\r\n"], ["user_id", 1], ["created_at", "2023-02-15 13:27:02.684853"], ["updated_at", "2023-02-15 13:27:02.684853"], ["company_id", 5]]
---
  def create
    @article = current_user.articles.new(article_params)

    if @article.save